[
  {
    "name": "Silky Steamed Eggs",
    "description": "These silky, savory, and warming steamed eggs are a simple comfort food I grew up eating in Taiwan. ",
    "ingredients": [
      {
        "id": "69ae472952fc0680",
        "amount": 1
      },
      {
        "id": "Bh786kl4",
        "amount": 4
      },
      {
        "id": "43dae41abc04bef6",
        "amount": 5
      }
    ],
    "portion": 4,
    "preparationTime": 30,
    "steps": [
      "Place mushrooms in a medium bowl and pour in 1½ cups hot water to cover. Let sit 30 minutes to rehydrate.",
      "Squeeze out rehydrated mushrooms over bowl to catch soaking liquid; thinly slice mushrooms.",
      "Add eggs and hon-dashi to bowl of mushroom soaking liquid and whisk to combine. Strain through a fine-mesh sieve into a heatproof serving bowl (you will steam and serve from this bowl) to remove bubbles. Using a spoon, skim off any remaining bubbles, then gently sprinkle mushrooms over egg mixture.",
      "Place a steaming rack or basket in a large pot with a lid (make sure your bowl will fit in the pot when covered with lid). Pour in water to come 2\" up sides of pot and bring to a simmer over medium heat. If using a Tatung steamer instead, add 1 cup water to steamer.",
      "Carefully place bowl with egg mixture into steamer and cover immediately, leaving lid slightly askew for steam to escape. Reduce heat to medium-low and steam, adjusting heat as needed to keep water at a gentle boil, until egg mixture is set and jiggly when shaken, 12–15 minutes. If using a Tatung steamer, place bowl with egg mixture in steamer and cover with lid, propping open with a folded paper towel. Press cook switch and wait until switch bounces back, about 15 minutes."
    ],
    "categoryId": [
      "56rKd785abJudv75"
    ],
    "id": "c980af7acd19f135",
    "approved": true,
    "date": "2023-05-24T07:49:58.863Z",
    "image": "file_ea9ba2c7f9a00fec.jpg"
  },
  {
    "name": "Lazy Butter Chicken",
    "description": "The most flavourful creamy curry with a warming heat.",
    "ingredients": [
      {
        "id": "d271b2333bcb07f0",
        "amount": 400
      },
      {
        "id": "29c8b7c9b7e21c8f",
        "amount": 250
      },
      {
        "id": "06248b07b391d5e1",
        "amount": 50
      },
      {
        "id": "1ea617702210baa6",
        "amount": 3
      },
      {
        "id": "d36e0fe0ec07ac08",
        "amount": 1
      },
      {
        "id": "b07d0cc0611fca1d",
        "amount": 1000
      },
      {
        "id": "435a3f5359a6349a",
        "amount": 60
      },
      {
        "id": "ce54fa8975d5e933",
        "amount": 1
      },
      {
        "id": "964e5a3445075dba",
        "amount": 2
      }
    ],
    "portion": 4,
    "preparationTime": 45,
    "steps": [
      "Dice the onions and finely slice the garlic.",
      "In a large pan, heat half the butter and 30ml oil and add the onions and garlic. Cook until they’re light golden.",
      "Now go in with all of the kashmiri chilli, ground coriander and salt and cook for another 2 mins.",
      "Add the tomatoes, cashew nuts and water and bring to a boil. Cover and let it simmer for 30 mins.",
      "Blend with a stick blender until smooth and saucy.",
      "Gently toast kasuri methi (fenugreek leaves) in a pan for about 3 mins until fragrant.",
      "\nCrush in a pestle and mortar and add to the curry base along with the cinnamon, cardamom and honey.",
      "Add the cream and butter and shred in the leftover chicken. Cook for a further 5 mins.",
      "Serve with rice or naan bread and garnish with another drizzle of cream and a pinch of methi."
    ],
    "categoryId": [],
    "id": "d83504d7e20c81f2",
    "approved": true,
    "date": "2023-05-24T10:08:35.072Z",
    "image": "file_4b4fec01a4e1ae71.jpg"
  },
  {
    "name": "Vegan Creamy Tofu Curry",
    "description": "We've taken inspo from a curry favourite of ours made with halloumi, but made it vegan. Enter, Creamy Tofu Curry. Don't worry, it's just as delicious.",
    "ingredients": [
      {
        "id": "42748aec81a25d0f",
        "amount": 1
      },
      {
        "id": "fb1a4f028eab69a1",
        "amount": 1
      },
      {
        "id": "db483fe0b249c8ec",
        "amount": 1
      },
      {
        "id": "e303c448a018118c",
        "amount": 2
      },
      {
        "id": "563d13b5343c30e1",
        "amount": 1
      },
      {
        "id": "2cf372a6e57ada53",
        "amount": 1
      },
      {
        "id": "bf617aece4a4ab15",
        "amount": 1
      },
      {
        "id": "b90dba67798a8aa6",
        "amount": 40
      },
      {
        "id": "3ef29a5675d58679",
        "amount": 800
      },
      {
        "id": "fb8051262111fb94",
        "amount": 400
      },
      {
        "id": "bdd8f25f5413f78f",
        "amount": 400
      },
      {
        "id": "d7f7a9b0433523e4",
        "amount": 1
      },
      {
        "id": "58ab7aa980710dba",
        "amount": 3
      }
    ],
    "portion": 4,
    "preparationTime": 45,
    "steps": [
      "Chop the tofu and cauliflower into bite-sized pieces. Cut onion into slices.",
      "Heat a large pan and add a splash of vegetable oil. Add your onions. Cook on a medium-high heat so they start catching on the pan and softening. Once the onions start to brown, add your cubes of tofu.",
      "As the tofu starts to brown, add grated garlic cloves, a grated knob of ginger, a heaped tsp of turmeric, 1 ½ tsp of chilli powder and 2 tsp of garam masala. Mix everything together, add your cauliflower and tomato purée. Mix it in.",
      "Pour in your tinned tomatoes and your coconut milk. Stir everything together.",
      "Get your rice on (follow pack instructions).",
      "Cook on a medium heat until the curry is nice and thick.",
      "Serve the curry on top of your steaming rice. Garnish with freshly chopped coriander."
    ],
    "categoryId": [
      "1Ohk8dhAP8h73jK4"
    ],
    "id": "2b0e439b28942764",
    "approved": true,
    "date": "2023-05-24T10:26:44.893Z",
    "image": "file_6640bf9532084a6f.png"
  },
  {
    "name": "Rosemary Aioli BLT",
    "description": "Level up everyone’s favourite sarnie with a homemade rosemary infused aioli. Crack open an Inch’s Cider to sip on the side.",
    "ingredients": [
      {
        "id": "20392aea9a25c498",
        "amount": 16
      },
      {
        "id": "5679de7264736bf7",
        "amount": 2
      },
      {
        "id": "c7d0a9c3bf87d517",
        "amount": 1
      },
      {
        "id": "e303c448a018118c",
        "amount": 3
      },
      {
        "id": "063c7a6d36ccb43e",
        "amount": 1
      },
      {
        "id": "2920acb5937918d9",
        "amount": 250
      },
      {
        "id": "dac6b972342bfc84",
        "amount": 4
      },
      {
        "id": "b07d0cc0611fca1d",
        "amount": 300
      }
    ],
    "portion": 4,
    "preparationTime": 25,
    "steps": [
      "Preheat the oven to 210°C",
      "Lay the bacon out on a parchment-lined baking tray. Slide into the oven for 12-13 mins, flipping halfway, until rendered and very crispy.",
      "Meanwhile, whip up the aioli. Add the yolks and dijon to the bowl of a food processor. Finely grate in the garlic and add the juice of the lemon. Season with salt and turn the processor on. Slowly stream in the oil until you have a thick, rich aioli.",
      "Strip the leaves from half of the rosemary and finely chop. Blitz into the aioli, season to taste and you’re all done. Tip into a bowl and set aside.",
      "Cut the tomatoes into thick slices and season very generously with olive oil, salt and pepper. Set aside to macerate.",
      "Once the bacon is crispy, pull it out the oven and remove from the tray, leaving the fat behind. Pop the remaining rosemary onto the tray, toss in the fat and slide back into the oven for 2 mins to crisp up. Remove and set aside.",
      "Lay out your slices of bread (toasted, if you like) and add a generous spoon of aioli to each side. Lay down the lettuce leaves and top with seasoned tomatoes. Pile on the crispy bacon and crumble over the crispy rosemary leaves.",
      "Add a lid, cut in half and get stuck in. Pairs perfectly with an Inch’s Cider."
    ],
    "categoryId": [
      "64gdfsbZGhb85iKa",
      "68LorN7dG348tR4"
    ],
    "id": "4a7fd3be146617dc",
    "approved": true,
    "date": "2023-05-24T10:39:07.645Z",
    "image": "file_e4f75bd1692803ec.png"
  },
  {
    "name": "Baked Salmon",
    "description": "Delicious and healthy baked salmon with a flavorful glaze.",
    "ingredients": [
      {
        "id": "dbb3e9c50c2ac134",
        "amount": 1
      },
      {
        "id": "964e5a3445075dba",
        "amount": 2
      },
      {
        "id": "40a704cfe5eb2f66",
        "amount": 2
      },
      {
        "id": "c0e47c3431f07aae",
        "amount": 2
      }
    ],
    "portion": 2,
    "preparationTime": 25,
    "steps": [
      "Preheat the oven to 375°F (190°C) and line a baking sheet with parchment paper.",
      "Place the salmon fillet on the baking sheet and drizzle with olive oil.",
      "Season with salt and pepper, then top with lemon slices.",
      "In a small bowl, whisk together honey, Dijon mustard, and minced garlic.",
      "Brush the glaze over the salmon, coating it evenly.",
      "Bake for 15-20 minutes until the salmon is cooked through and flakes easily with a fork.",
      "Garnish with fresh dill and serve hot."
    ],
    "categoryId": [
      "sU5jw9PKM6NbvDeX"
    ],
    "id": "4c1d3901f0447196",
    "approved": true,
    "date": "2023-05-24T10:44:52.480Z",
    "image": "file_2cbf7228a20ffc6f.jpg"
  },
  {
    "name": "Chicken Curry",
    "description": "A flavorful and aromatic chicken curry with spices and coconut milk.",
    "ingredients": [
      {
        "id": "58ab7aa980710dba",
        "amount": 2
      },
      {
        "id": "f5f709c0bf773f39",
        "amount": 1
      },
      {
        "id": "c0e47c3431f07aae",
        "amount": 2
      }
    ],
    "portion": 4,
    "preparationTime": 40,
    "steps": [
      "Heat vegetable oil in a large skillet or pot over medium heat.",
      "Add onion, garlic, and ginger. Sauté until onions are translucent and fragrant.",
      "Add curry powder, turmeric, cumin, paprika, and coriander. Stir and cook for 1-2 minutes until spices are fragrant.",
      "Add chicken breast cubes and cook until browned on all sides.",
      "Pour in coconut milk and chicken broth. Season with salt and pepper.",
      "Simmer for 20-25 minutes until the chicken is cooked through and tender.",
      "Garnish with fresh cilantro and serve hot with rice or naan bread."
    ],
    "categoryId": [
      "64gdfsbZGhb85iKa",
      "f81sml6eD7EdtTtV"
    ],
    "id": "89eec27279422d2b",
    "approved": true,
    "date": "2023-05-24T10:52:04.676Z",
    "image": "file_3441e35434040730.jpg"
  },
  {
    "name": "Svickova",
    "description": "muj prvni recept!!!",
    "ingredients": [
      {
        "id": "Bh786kl4",
        "amount": 5
      }
    ],
    "portion": 3,
    "preparationTime": 10,
    "steps": [
      "Uvarit"
    ],
    "categoryId": [
      "64gdfsbZGhb85iKa"
    ],
    "id": "e545a908a4c840c2",
    "approved": false,
    "date": "2023-05-24T11:46:36.521Z",
    "image": "file_1e3f0eec90cd7fe0.jpg"
  }
]